In [1]:
import pandas as pd
import numpy as np
import datetime as dt

In [7]:
offline_train = pd.read_csv("../data/ccf_offline_stage1_train.csv")
print(offline_train.shape)
display(offline_train.head())
print(offline_train.Date.min(),offline_train.Date.max())

(1754884, 7)

,User_id,Merchant_id,Coupon_id,Discount_rate,Distance,Date_received,Date
0,1439408,2632,null,null,0,null,20160217
1,1439408,4663,11002,150:20,1,20160528,null
2,1439408,2632,8591,20:1,0,20160217,null
3,1439408,2632,1078,20:1,0,20160319,null
4,1439408,2632,8591,20:1,0,20160613,null

20160101 null

In [4]:
online_train = pd.read_csv("../data/ccf_online_stage1_train.csv")
print(online_train.shape)
display(online_train.head())

(11429826, 7)

,User_id,Merchant_id,Action,Coupon_id,Discount_rate,Date_received,Date
0,13740231,18907,2,100017492,500:50,20160513,null
1,13740231,34805,1,null,null,null,20160321
2,14336199,18907,0,null,null,null,20160618
3,14336199,18907,0,null,null,null,20160618
4,14336199,18907,0,null,null,null,20160618

In [6]:
offline_test = pd.read_csv("../data/ccf_offline_stage1_test_revised.csv")
print(offline_test.shape)
display(offline_test.head())

(113640, 6)

   User_id  Merchant_id  Coupon_id Discount_rate Distance  Date_received
0  4129537          450       9983          30:5        1       20160712
1  6949378         1300       3429          30:5     null       20160706
2  2166529         7113       6928        200:20        5       20160727
3  2166529         7113       1808        100:10        5       20160727
4  6172162         7605       6500          30:1        2       20160708

##  将数据分为3个数据集 利用滑窗法
## 将2016年1月1日到4月13日的数据提取特征，利用4月14日的到5月14日的作为测试集
## 将2月1日到5月14日的作为数据集提取特征，利用5月15日6月15日的作为测试集
## 将3月15日到6月30日作为数据集提取特征，再测试7月1日到7月31日的数据